ssh/struts2例子.org
* 配置
** 引入struts2
 - web.xml配置
 - 例子
#+BEGIN_SRC xml
   <filter>
	<filter-name>struts2</filter-name>
	<filter-class>org.apache.struts2.dispatcher.FilterDispatcher</filter-class>
  </filter>
  
  <filter-mapping>
	<filter-name>struts2</filter-name>
	<url-pattern>/*</url-pattern>
  </filter-mapping>
#+END_SRC

** action配置
*** xml配置
 - 在struts.xml中配置
 - 例子
 #+BEGIN_SRC xml
 <package name="user" namespace="/User" extends="struts-default">
		<action name="Login">
			<result>pages/login.jsp</result>
		</action>
		<action name="Welcome" class="com.mkyong.user.action.WelcomeUserAction">
			<result name="SUCCESS">pages/welcome_user.jsp</result>
		</action>
	</package>
#+END_SRC
 - name 
   包的名称
 - namespace
   命名空间
 - extends
   继承的包
 - action
   actionde 配置
*** 注解配置
**** 配置位置
  - 配置在Action类中
  - 例子
#+BEGIN_SRC java
@Namespace("/User")
@ResultPath(value="/")
@Result(name="success",location="pages/login.jsp")
public class LoginAction ....
#+END_SRC
**** ResultPath
 - 配置该action对应物理视图资源的路径
 - struts2会到 项目上下文/pages/login.jsp找试图文件
***** 默认
 - 项目上下文/WEB-INF/content/命名空间/action中location值
 - 例子
      /Struts2Example/WEB-INF/content/User/pages/login.jsp
***** 自定义
 - 项目上下文/WEB-INF/ResultPath的值/命名空间/action中location值
 - 例子
      /Struts2Example/User/pages/login.jsp
***** 全局
 - 配置在Struts.xml中
 - 例子
#+BEGIN_SRC xml
  <struts>
    <constant name="struts.convention.result.path" value="/"/>
</struts>
#+END_SRC   
*** 多文件
 - 例子
#+BEGIN_SRC xml
  <include file="user/struts-user.xml"></include>
    <include file="audit/struts-audit.xml"></include>
#+END_SRC

*** 命令空间配置
 - 包名 name不会对实际结果造成影响
 - 命名空间会影响action的调用url
*** 映射
 - 访问url: 项目的上下文/命名空间/类名称.action
*** 开发模式
 - struts配置
#+BEGIN_SRC xml
  <constant name="struts.devMode" value="true" />
#+END_SRC

*** 去掉action后缀
**** struts配置
 - struts.action.extendsion的值设置为""
 - 例子
#+BEGIN_SRC xml
   <constant name="struts.action.extension" value=""/> 
#+END_SRC

** action的使用
*** 属性文件
**** 位置
 - action同目录
**** 名称
 - ***action.properties
**** 全局
 - global.properties
*** action
  1) 继承ActionSupport类
  2) addActionMessge("消息");
  3) addActionError(""消息);
 *** jsp页面
 - <s:actionerror/>
 - <s:actionmessage/>

*** modelDriven接口
 - 实体类
  + 属性实现setter/getter方法
 - action实现ModelDriven
  + 实例化该实体类
 - 功能
  + 页面直接提交该提示类的属性值
  + action自动设置实体类的属性值
** 拦截器
*** 默认设置
 - 如果action继承了struts-default,则自动继承了默认的拦截器设置
 - 拦截器的默认设置在struts-default.xml文件中被组织为defaultStack
 - 它位于struts2-core.jar文件中
*** 自定义拦截器
