ssh/struts2例子.org
**** 拦截器类
 - 实现com.opensymphony.xwork2.interceptor.Interceptor接口
 - 实现intercept(ActionInvocation invocation)方法
 - 必须调用invocation.invoke()方法并返回其结果
**** struts配置
 - interceptor-ref属性
 - 拦截器栈会按照配置的顺序依次加载
 - 多个拦截器可以写成一个拦截器栈
 - 例子
#+BEGIN_SRC xml
<interceptors>  
            <!-- 配置mySimpleInterceptor拦截器 -->  
            <interceptor name="mySimpleInterceptor" class="com.lee.action.SimpleInterceptor">  
                <!-- 为方法过滤拦截器指定name属性值 -->  
                <param name="name">简单方法过滤拦截器</param>  
            </interceptor>  
            <!-- 配置第二个拦截器 -->  
            <interceptor name="second" class="com.lee.action.SecondeInterceptor"></interceptor>  
  
            <!-- 配置名为my-stack的拦截器栈 -->  
            <interceptor-stack name="my-stack">  
                <!-- 配置拦截器栈内的第一个拦截器 -->  
                <interceptor-ref name="mySimpleInterceptor">  
                    <param name="name">第一个</param>  
                </interceptor-ref>  
                <!-- 配置拦截器栈内的第二个拦截器 -->  
                <interceptor-ref name="second">  
                    <param name="name">第二个</param>  
                </interceptor-ref>  
            </interceptor-stack>  
        </interceptors>  

<action name="testingAction" class="com.xuejava.common.action.TestingAction" >
      <interceptor-ref name="mySimpleInterceptor"/>
      <interceptor-ref name="logger"/>
      <interceptor-ref name="second"/>
      <interceptor-ref name="defaultStack"/>
      <result name="success">pages/result.jsp</result>
  </action>  
#+END_SRC

**** 拦截器参数
 - 参数名称带上拦截器名称
 - 例子
#+BEGIN_SRC xml
  <interceptor-ref name="defaultStack">
　　<param name="workflow.excludeMethods">whateverMethod</param>
 </interceptor-ref>
#+END_SRC

**** 重用多个拦截器栈
 - 例子
#+BEGIN_SRC xml
  <interceptors>
　　<interceptor-stack name="defaultStackWithLog">
　　<interceptor-ref name="timer"/>
　　<interceptor-ref name="logger"/>
　　<interceptor-ref name="defaultStack" />
　　</interceptor-stack>
　</interceptors>
 # 在需要拦截器的action中导入该拦截器包
#+END_SRC

**** execAndWait拦截器
***** action
 - 继承自ActionSupport
***** jsp
 - 定义载入中需要展示的页面
***** struts.xml
 - 例子
#+BEGIN_SRC xml
  <interceptor-ref name="execAndWait">
　　　　　　<param name="delay">1000</param>
　　　　　　<param name="delaySleepInterval">500</param>
　　　　</interceptor-ref>
　　　　<result name="wait">pages/wait.jsp</result>
　　　　<result name="success">pages/success.jsp</result>
#+END_SRC
** 资源包和本地化
*** 资源包
**** 查找顺序
 - ActionClass.properties
 - Interceptor.properties
 - BaseClass.properties
 - ModelDriven的model
 - Package.properties 
 - 在i18消息层级本身查找
 - 全局资源属性
**** 使用
