publish/html/struts2例子.html

<div id="outline-container-1-4-2" class="outline-4">
<h4 id="sec-1-4-2"><span class="section-number-4">1.4.2</span> 自定义拦截器 </h4>
<div class="outline-text-4" id="text-1-4-2">

<ul>
<li id="sec-1-4-2-1">拦截器类 <br/>
<ul>
<li>实现com.opensymphony.xwork2.interceptor.Interceptor接口
</li>
<li>实现intercept(ActionInvocation invocation)方法
</li>
<li>必须调用invocation.invoke()方法并返回其结果
</li>
</ul>

</li>
</ul>
<ul>
<li id="sec-1-4-2-2">struts配置 <br/>
<ul>
<li>interceptor-ref属性
</li>
<li>拦截器栈会按照配置的顺序依次加载
</li>
<li>多个拦截器可以写成一个拦截器栈
</li>
<li>例子
</li>
</ul>




<pre class="src src-xml">&lt;<span style="color: #7fffd4; font-weight: bold;">interceptors</span>&gt;  
            <span style="color: #add8e6;">&lt;!--</span><span style="color: #add8e6;"> &#37197;&#32622;mySimpleInterceptor&#25318;&#25130;&#22120; </span><span style="color: #add8e6;">--&gt;</span>  
            &lt;<span style="color: #7fffd4; font-weight: bold;">interceptor</span> <span style="color: #7fffd4; font-weight: bold;">name</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">mySimpleInterceptor</span><span style="color: #ffa07a;">"</span> <span style="color: #7fffd4; font-weight: bold;">class</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">com.lee.action.SimpleInterceptor</span><span style="color: #ffa07a;">"</span>&gt;  
                <span style="color: #add8e6;">&lt;!--</span><span style="color: #add8e6;"> &#20026;&#26041;&#27861;&#36807;&#28388;&#25318;&#25130;&#22120;&#25351;&#23450;name&#23646;&#24615;&#20540; </span><span style="color: #add8e6;">--&gt;</span>  
                &lt;<span style="color: #7fffd4; font-weight: bold;">param</span> <span style="color: #7fffd4; font-weight: bold;">name</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">name</span><span style="color: #ffa07a;">"</span>&gt;&#31616;&#21333;&#26041;&#27861;&#36807;&#28388;&#25318;&#25130;&#22120;&lt;/<span style="color: #7fffd4; font-weight: bold;">param</span>&gt;  
            &lt;/<span style="color: #7fffd4; font-weight: bold;">interceptor</span>&gt;  
            <span style="color: #add8e6;">&lt;!--</span><span style="color: #add8e6;"> &#37197;&#32622;&#31532;&#20108;&#20010;&#25318;&#25130;&#22120; </span><span style="color: #add8e6;">--&gt;</span>  
            &lt;<span style="color: #7fffd4; font-weight: bold;">interceptor</span> <span style="color: #7fffd4; font-weight: bold;">name</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">second</span><span style="color: #ffa07a;">"</span> <span style="color: #7fffd4; font-weight: bold;">class</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">com.lee.action.SecondeInterceptor</span><span style="color: #ffa07a;">"</span>&gt;&lt;/<span style="color: #7fffd4; font-weight: bold;">interceptor</span>&gt;  

            <span style="color: #add8e6;">&lt;!--</span><span style="color: #add8e6;"> &#37197;&#32622;&#21517;&#20026;my-stack&#30340;&#25318;&#25130;&#22120;&#26632; </span><span style="color: #add8e6;">--&gt;</span>  
            &lt;<span style="color: #7fffd4; font-weight: bold;">interceptor-stack</span> <span style="color: #7fffd4; font-weight: bold;">name</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">my-stack</span><span style="color: #ffa07a;">"</span>&gt;  
                <span style="color: #add8e6;">&lt;!--</span><span style="color: #add8e6;"> &#37197;&#32622;&#25318;&#25130;&#22120;&#26632;&#20869;&#30340;&#31532;&#19968;&#20010;&#25318;&#25130;&#22120; </span><span style="color: #add8e6;">--&gt;</span>  
                &lt;<span style="color: #7fffd4; font-weight: bold;">interceptor-ref</span> <span style="color: #7fffd4; font-weight: bold;">name</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">mySimpleInterceptor</span><span style="color: #ffa07a;">"</span>&gt;  
                    &lt;<span style="color: #7fffd4; font-weight: bold;">param</span> <span style="color: #7fffd4; font-weight: bold;">name</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">name</span><span style="color: #ffa07a;">"</span>&gt;&#31532;&#19968;&#20010;&lt;/<span style="color: #7fffd4; font-weight: bold;">param</span>&gt;  
                &lt;/<span style="color: #7fffd4; font-weight: bold;">interceptor-ref</span>&gt;  
                <span style="color: #add8e6;">&lt;!--</span><span style="color: #add8e6;"> &#37197;&#32622;&#25318;&#25130;&#22120;&#26632;&#20869;&#30340;&#31532;&#20108;&#20010;&#25318;&#25130;&#22120; </span><span style="color: #add8e6;">--&gt;</span>  
                &lt;<span style="color: #7fffd4; font-weight: bold;">interceptor-ref</span> <span style="color: #7fffd4; font-weight: bold;">name</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">second</span><span style="color: #ffa07a;">"</span>&gt;  
                    &lt;<span style="color: #7fffd4; font-weight: bold;">param</span> <span style="color: #7fffd4; font-weight: bold;">name</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">name</span><span style="color: #ffa07a;">"</span>&gt;&#31532;&#20108;&#20010;&lt;/<span style="color: #7fffd4; font-weight: bold;">param</span>&gt;  
                &lt;/<span style="color: #7fffd4; font-weight: bold;">interceptor-ref</span>&gt;  
            &lt;/<span style="color: #7fffd4; font-weight: bold;">interceptor-stack</span>&gt;  
        &lt;/<span style="color: #7fffd4; font-weight: bold;">interceptors</span>&gt;  

&lt;<span style="color: #7fffd4; font-weight: bold;">action</span> <span style="color: #7fffd4; font-weight: bold;">name</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">testingAction</span><span style="color: #ffa07a;">"</span> <span style="color: #7fffd4; font-weight: bold;">class</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">com.xuejava.common.action.TestingAction</span><span style="color: #ffa07a;">"</span> &gt;
      &lt;<span style="color: #7fffd4; font-weight: bold;">interceptor-ref</span> <span style="color: #7fffd4; font-weight: bold;">name</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">mySimpleInterceptor</span><span style="color: #ffa07a;">"</span>/&gt;
      &lt;<span style="color: #7fffd4; font-weight: bold;">interceptor-ref</span> <span style="color: #7fffd4; font-weight: bold;">name</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">logger</span><span style="color: #ffa07a;">"</span>/&gt;
      &lt;<span style="color: #7fffd4; font-weight: bold;">interceptor-ref</span> <span style="color: #7fffd4; font-weight: bold;">name</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">second</span><span style="color: #ffa07a;">"</span>/&gt;
      &lt;<span style="color: #7fffd4; font-weight: bold;">interceptor-ref</span> <span style="color: #7fffd4; font-weight: bold;">name</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">defaultStack</span><span style="color: #ffa07a;">"</span>/&gt;
      &lt;<span style="color: #7fffd4; font-weight: bold;">result</span> <span style="color: #7fffd4; font-weight: bold;">name</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">success</span><span style="color: #ffa07a;">"</span>&gt;pages/result.jsp&lt;/<span style="color: #7fffd4; font-weight: bold;">result</span>&gt;
  &lt;/<span style="color: #7fffd4; font-weight: bold;">action</span>&gt;  
</pre>




</li>
</ul>
<ul>
<li id="sec-1-4-2-3">拦截器参数 <br/>
<ul>
<li>参数名称带上拦截器名称
</li>
<li>例子
</li>
</ul>




<pre class="src src-xml">  &lt;<span style="color: #7fffd4; font-weight: bold;">interceptor-ref</span> <span style="color: #7fffd4; font-weight: bold;">name</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">defaultStack</span><span style="color: #ffa07a;">"</span>&gt;
&#12288;&#12288;&lt;<span style="color: #7fffd4; font-weight: bold;">param</span> <span style="color: #7fffd4; font-weight: bold;">name</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">workflow.excludeMethods</span><span style="color: #ffa07a;">"</span>&gt;whateverMethod&lt;/<span style="color: #7fffd4; font-weight: bold;">param</span>&gt;
 &lt;/<span style="color: #7fffd4; font-weight: bold;">interceptor-ref</span>&gt;
</pre>




</li>
</ul>
<ul>
<li id="sec-1-4-2-4">重用多个拦截器栈 <br/>
<ul>
<li>例子
</li>
</ul>




<pre class="src src-xml">  &lt;<span style="color: #7fffd4; font-weight: bold;">interceptors</span>&gt;
&#12288;&#12288;&lt;<span style="color: #7fffd4; font-weight: bold;">interceptor-stack</span> <span style="color: #7fffd4; font-weight: bold;">name</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">defaultStackWithLog</span><span style="color: #ffa07a;">"</span>&gt;
&#12288;&#12288;&lt;<span style="color: #7fffd4; font-weight: bold;">interceptor-ref</span> <span style="color: #7fffd4; font-weight: bold;">name</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">timer</span><span style="color: #ffa07a;">"</span>/&gt;
&#12288;&#12288;&lt;<span style="color: #7fffd4; font-weight: bold;">interceptor-ref</span> <span style="color: #7fffd4; font-weight: bold;">name</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">logger</span><span style="color: #ffa07a;">"</span>/&gt;
&#12288;&#12288;&lt;<span style="color: #7fffd4; font-weight: bold;">interceptor-ref</span> <span style="color: #7fffd4; font-weight: bold;">name</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">defaultStack</span><span style="color: #ffa07a;">"</span> /&gt;
&#12288;&#12288;&lt;/<span style="color: #7fffd4; font-weight: bold;">interceptor-stack</span>&gt;
&#12288;&lt;/<span style="color: #7fffd4; font-weight: bold;">interceptors</span>&gt;
 # &#22312;&#38656;&#35201;&#25318;&#25130;&#22120;&#30340;action&#20013;&#23548;&#20837;&#35813;&#25318;&#25130;&#22120;&#21253;
</pre>




</li>
</ul>
<ul>
<li id="sec-1-4-2-5">execAndWait拦截器 <br/>
<ul>
<li id="sec-1-4-2-5-1">action <br/>
<ul>
<li>继承自ActionSupport
</li>
</ul>

</li>
</ul>
<ul>
<li id="sec-1-4-2-5-2">jsp <br/>
<ul>
<li>定义载入中需要展示的页面
</li>
</ul>

</li>
</ul>
<ul>
<li id="sec-1-4-2-5-3">struts.xml <br/>
<ul>
<li>例子
</li>
</ul>




<pre class="src src-xml">  &lt;<span style="color: #7fffd4; font-weight: bold;">interceptor-ref</span> <span style="color: #7fffd4; font-weight: bold;">name</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">execAndWait</span><span style="color: #ffa07a;">"</span>&gt;
&#12288;&#12288;&#12288;&#12288;&#12288;&#12288;&lt;<span style="color: #7fffd4; font-weight: bold;">param</span> <span style="color: #7fffd4; font-weight: bold;">name</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">delay</span><span style="color: #ffa07a;">"</span>&gt;1000&lt;/<span style="color: #7fffd4; font-weight: bold;">param</span>&gt;
&#12288;&#12288;&#12288;&#12288;&#12288;&#12288;&lt;<span style="color: #7fffd4; font-weight: bold;">param</span> <span style="color: #7fffd4; font-weight: bold;">name</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">delaySleepInterval</span><span style="color: #ffa07a;">"</span>&gt;500&lt;/<span style="color: #7fffd4; font-weight: bold;">param</span>&gt;
&#12288;&#12288;&#12288;&#12288;&lt;/<span style="color: #7fffd4; font-weight: bold;">interceptor-ref</span>&gt;
&#12288;&#12288;&#12288;&#12288;&lt;<span style="color: #7fffd4; font-weight: bold;">result</span> <span style="color: #7fffd4; font-weight: bold;">name</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">wait</span><span style="color: #ffa07a;">"</span>&gt;pages/wait.jsp&lt;/<span style="color: #7fffd4; font-weight: bold;">result</span>&gt;
&#12288;&#12288;&#12288;&#12288;&lt;<span style="color: #7fffd4; font-weight: bold;">result</span> <span style="color: #7fffd4; font-weight: bold;">name</span>=<span style="color: #ffa07a;">"</span><span style="color: #ffa07a;">success</span><span style="color: #ffa07a;">"</span>&gt;pages/success.jsp&lt;/<span style="color: #7fffd4; font-weight: bold;">result</span>&gt;
</pre>



</li>
</ul>
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> 资源包和本地化 </h3>
<div class="outline-text-3" id="text-1-5">


</div>

<div id="outline-container-1-5-1" class="outline-4">
<h4 id="sec-1-5-1"><span class="section-number-4">1.5.1</span> 资源包 </h4>
<div class="outline-text-4" id="text-1-5-1">

<ul>
<li id="sec-1-5-1-1">查找顺序 <br/>
<ul>
<li>ActionClass.properties
</li>
<li>Interceptor.properties
</li>
<li>BaseClass.properties
</li>
<li>ModelDriven的model
</li>
<li>Package.properties 
</li>
<li>在i18消息层级本身查找
</li>
<li>全局资源属性
</li>
</ul>

</li>
</ul>
<ul>
<li id="sec-1-5-1-2">使用 <br/>
<ul>
<li id="sec-1-5-1-2-1">action使用 <br/>
<ul>
<li>继承 ActionSupport
</li>
<li>getText("自文件名称")
</li>
<li>例子
</li>
</ul>
