ssh/struts2例子.org
***** action使用
 - 继承 ActionSupport
 - getText("自文件名称")
 - 例子
#+BEGIN_SRC java
  public class LoginAction extends ActionSupport{
  ...
   public void validate(){
     addFieldError("userName",getText("userName.required"));
   }
  ...
  }
#+END_SRC

***** 属性标签
 - 在<s:property>标签中使用getText("属性文件名称")
  + 例子
#+BEGIN_SRC html
 <s:property value="getText("userName")"/>
#+END_SRC
 - <s:text>标签
  + 例子
#+BEGIN_SRC html
 <s:text name="userName"/>
#+END_SRC
 - key属性
  + 例子
#+BEGIN_SRC html
 <s:textfield key="username" /> 
#+END_SRC
 - i18n标签
  + 例子
#+BEGIN_SRC html
 <s:i18n name="com.xuejava.user.package" >
     　　 <s:text name="username" />
</s:i18n> 
#+END_SRC

*** i18n与本地化
**** 项目结构
 - Action类下对应的属性文件命名
 - 包对应的属性文件命名
 - 例子 
  + LoginAction_zh_CN.properties
  + global_en.properties
**** 属性文件
 - 以国家指定的编码命名
 - native2ascii工具或其他
**** action
 - getText()
 - 例子
 #+BEGIN_SRC java
  //简单验证
　　public void validate(){
　　　　if("".equals(getUsername())){
　　　　　　addFieldError("username", getText("username.required"));
　　　　}
　　　　if("".equals(getPassword())){
　　　　　　addFieldError("password", getText("password.required"));
　　　　}
　　}
#+END_SRC
**** jsp视图
 - 必须使用申明<%@page contentType=”text/html;charset=UTF-8”%>
 - 要改变默认的地区，我们需要声明一个“request_locale”参数，设置首选语言编码并传递给Action类
**** 显示资源包信息
 - 例子
#+BEGIN_SRC jsp
<s:textfield key="global.username" name="username" />
<s:text name="global.username" /> 
<s:property value="getText('global.username')" />
<s:text name="global.password" />
#+END_SRC
**** struts.xml配置
 - 例子
#+BEGIN_SRC xml
  <constant name="struts.custom.i18n.resources" value="global" />
#+END_SRC

** struts2的动态方法调用
*** action的配置
#+BEGIN_SRC xml
<action name="actionName_*" class="action的完整路径" method="{1}">  
#+END_SRC
*** jsp页面的调用
#+BEGIN_SRC html
  action="actionName_执行方法?参数名称=参数值&其他参数..."
#+END_SRC
** action属性参数的接收
*** 一般属性
 - setter/getter方法
 - Url传递
*** 域模型
 - 
